DOE_3/run14/0_orig/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottom
    {
        type fixedValue;
        value uniform (0 0 0);
    }

    top
    {
        type fixedValue;
        value uniform (0 0 0);
    }

    left
    {
        type fixedValue;
        value uniform (0 0 0);
    }

    right
    {
        type fixedValue;
        value uniform (0 0 0);
    }

    front
    {
        type empty;
    }

    back
    {
        type empty;
    }
}
